# База данных книжного магазина
db = [
    {
        "title": "Мастер и Маргарита",
        "price": 850.21,
        "quantity": 15,
        "authors": ["Михаил Булгаков"],
        "isbn": "3213-213-1-4431-341",
        "rating": 4.8,
        "hardcover": True,
        "genres": ["роман", "фантастика", "сатира"]
    },
    {
        "title": "Библия",
        "price": 9999.99,
        "quantity": 73,
        "authors": ["Апостол1", "Апостол2"],
        "isbn": "111-1-1-1-1-111",
        "rating": 5.0,
        "hardcover": True,
        "genres": ["основано на реальных событиях", "теология", "вера"]
    },
    {
        "title": "Преступление и наказание",
        "price": 380.50,
        "quantity": 8,
        "authors": ["Федор Достоевский"],
        "isbn": "111-1-1-1-1-111",
        "rating": 4.9,
        "hardcover": False,
        "genres": ["роман", "психология", "классика"]
    },
    {
        "title": "Питон для начинающих",
        "price": 890.75,
        "quantity": 25,
        "authors": ["Иван Петров", "Мария Сидорова", "Алексей Кузнецов"],
        "isbn": "412-214-21-4-21-4",
        "rating": 4.5,
        "hardcover": True,
        "genres": ["программирование", "учебник", "компьютеры"]
    },
    {
        "title": "1984",
        "price": 520.25,
        "quantity": 12,
        "authors": ["Джордж Оруэлл"],
        "isbn": "532-523-5-235-235",
        "rating": 4.7,
        "hardcover": True,
        "genres": ["антиутопия", "политика", "фантастика"]
    }
]

print("Содержимое базы данных книжного магазина ({} книги):".format(len(db)))

for book_i in range(len(db)):
    print(f"{book_i + 1}.")
    print("Название: {}".format(db[book_i]["title"]))
    print("Цена: {} руб.".format(db[book_i]["price"]))
    print("Количество в наличии: {}".format(db[book_i]["quantity"]))
    print("Авторы: {}".format(", ".join(db[book_i]["authors"])))
    print("ISBN: {}".format(db[book_i]["isbn"]))
    print("Рейтинг: {}/5".format(db[book_i]["rating"]))
    print("Твердый переплет: {}".format(db[book_i]["hardcover"]))
    print("Жанры: {} \n".format(", ".join(db[book_i]["genres"])))


# --------------
# Пример вывода:
# --------------
# C:\Users\korudenko\PycharmProjects\Py3semestr2025RudenkoKTmo2-16\.venv\Scripts\python.exe C:\Users\korudenko\PycharmProjects\Py3semestr2025RudenkoKTmo2-16\laba2\Part2.py
# Содержимое базы данных книжного магазина (5 книги):
# 1.
# Название: Мастер и Маргарита
# Цена: 850.21 руб.
# Количество в наличии: 15
# Авторы: Михаил Булгаков
# ISBN: 3213-213-1-4431-341
# Рейтинг: 4.8/5
# Твердый переплет: True
# Жанры: роман, фантастика, сатира
#
# 2.
# Название: Библия
# Цена: 9999.99 руб.
# Количество в наличии: 73
# Авторы: Апостол1, Апостол2
# ISBN: 111-1-1-1-1-111
# Рейтинг: 5.0/5
# Твердый переплет: True
# Жанры: основано на реальных событиях, теология, вера
#
# 3.
# Название: Преступление и наказание
# Цена: 380.5 руб.
# Количество в наличии: 8
# Авторы: Федор Достоевский
# ISBN: 111-1-1-1-1-111
# Рейтинг: 4.9/5
# Твердый переплет: False
# Жанры: роман, психология, классика
#
# 4.
# Название: Питон для начинающих
# Цена: 890.75 руб.
# Количество в наличии: 25
# Авторы: Иван Петров, Мария Сидорова, Алексей Кузнецов
# ISBN: 412-214-21-4-21-4
# Рейтинг: 4.5/5
# Твердый переплет: True
# Жанры: программирование, учебник, компьютеры
#
# 5.
# Название: 1984
# Цена: 520.25 руб.
# Количество в наличии: 12
# Авторы: Джордж Оруэлл
# ISBN: 532-523-5-235-235
# Рейтинг: 4.7/5
# Твердый переплет: True
# Жанры: антиутопия, политика, фантастика
#
#
# Process finished with exit code 0
